Revit 2026 API

# ColorFillFailures Properties

---

The BuiltInFailuresColorFillFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OnlyOneColorFillNonPlan | A Color Fill Legend can only be placed in a Floor Plan View or a Section View. |
|  | SymtemColorFillLegendNotAllowed | [Category name] Color Fill Legend can only be placed in a Floor Plan View. |

#### Reference

BuiltInFailuresColorFillFailures Class

Autodesk.Revit.DB Namespace